package ru.dgk.DataTECg.entity;

public enum IDs {

    GASC("6303773", "Расход", "gas", "ГАЗ"),
    GAST("6303772", "Температура", "gas", "ГАЗ"),
    GASP("6303774", "Давление", "gas", "ГАЗ"),

    HM1MAKEUP("6303789", "Подпитка", "hm1", "Теплотрасса 1,2"),
    HM1СF("6303717", "Расход прямой.", "hm1", "Теплотрасса 1,2"),
    HM1CB("6303716", "Расход обратный", "hm1", "Теплотрасса 1,2"),
    HM1PB("6303715", "Давление обратное", "hm1", "Теплотрасса 1,2"),
    HM1PF("6303714", "Давление прямое", "hm1", "Теплотрасса 1,2"),
    HM1TF("6303712", "Температура прямая", "hm1", "Теплотрасса 1,2"),
    HM1TB("6303711", "Температура обрат.", "hm1", "Теплотрасса 1,2"),
    HM1GF("6303710", "Тепло прямое", "hm1", "Теплотрасса 1,2"),
    HM1GB("6303709", "Тепло обратное", "hm1", "Теплотрасса 1,2"),

    HM3MAKEUP("6303809", "Подпитка", "hm3", "Теплотрасса 3"),
    HM3СF("6303726", "Расход прямой.", "hm3", "Теплотрасса 3"),
    HM3CB("6303725", "Расход обратный", "hm3", "Теплотрасса 3"),
    HM3PB("6303723", "Давление обратное", "hm3", "Теплотрасса 3"),
    HM3PF("6303760", "Давление прямое", "hm3", "Теплотрасса 3"),
    HM3TF("6303721", "Температура прямая", "hm3", "Теплотрасса 3"),
    HM3TB("6303720", "Температура обрат.", "hm3", "Теплотрасса 3"),
    HM3GF("6303719", "Тепло прямое", "hm3", "Теплотрасса 3"),
    HM3GB("6303718", "Тепло обратное", "hm3", "Теплотрасса 3"),

    HM7MAKEUP("6303810", "Подпитка", "hm7", "Теплотрасса 7"),
    HM7СF("6303735", "Расход прямой.", "hm7", "Теплотрасса 7"),
    HM7CB("6303734", "Расход обратный", "hm7", "Теплотрасса 7"),
    HM7PB("6303732", "Давление обратное", "hm7", "Теплотрасса 7"),
    HM7PF("6303733", "Давление прямое", "hm7", "Теплотрасса70"),
    HM7TF("6303730", "Температура прямая", "hm7", "Теплотрасса 7"),
    HM7TB("6303729", "Температура обрат.", "hm7", "Теплотрасса 7"),
    HM7GF("6303728", "Тепло прямое", "hm7", "Теплотрасса 7"),
    HM7GB("6303727", "Тепло обратное", "hm7", "Теплотрасса 7"),

    HM8MAKEUP("6303811", "Подпитка", "hm8", "Теплотрасса 8"),
    HM8СF("6303744", "Расход прямой.", "hm5", "Теплотрасса 8"),
    HM8CB("6303743", "Расход обратный", "hm5", "Теплотрасса 8"),
    HM8PB("6303741", "Давление обратное", "hm5", "Теплотрасса 8"),
    HM8PF("6303742", "Давление прямое", "hm5", "Теплотрасса 8"),
    HM8TF("6303739", "Температура прямая", "hm5", "Теплотрасса 8"),
    HM8TB("6303738", "Температура обрат.", "hm5", "Теплотрасса 8"),
    HM8GF("6303737", "Тепло прямое", "hm5", "Теплотрасса 8"),
    HM8GB("6303736", "Тепло обратное", "hm5", "Теплотрасса 8"),

    HM9MAKEUP("6303812", "Подпитка", "hm9", "Теплотрасса 9"),
    HM9СF("6303753", "Расход прямой.", "hm9", "Теплотрасса 9"),
    HM9CB("6303752", "Расход обратный", "hm9", "Теплотрасса 9"),
    HM9PB("6303750", "Давление обратное", "hm9", "Теплотрасса 9"),
    HM9PF("6303751", "Давление прямое", "hm9", "Теплотрасса 9"),
    HM9TF("6303748", "Температура прямая", "hm9", "Теплотрасса 9"),
    HM9TB("6303747", "Температура обрат.", "hm9", "Теплотрасса 9"),
    HM9GF("6303746", "Тепло прямое", "hm9", "Теплотрасса 9"),
    HM9GB("6303745", "Тепло обратное", "hm9", "Теплотрасса 9"),

    HM10MAKEUP("6303790", "Подпитка", "hm10", "Теплотрасса 10"),
    HM10СF("6303761", "Расход прямой.", "hm10", "Теплотрасса 10"),
    HM10CB("6303762", "Расход обратный", "hm10", "Теплотрасса 10"),
    HM10PB("6303759", "Давление обратное", "hm10", "Теплотрасса 10"),
    HM10PF("6303760", "Давление прямое", "hm10", "Теплотрасса 10"),
    HM10TF("6303757", "Температура прямая", "hm10", "Теплотрасса 10"),
    HM10TB("6303756", "Температура обрат.", "hm10", "Теплотрасса 10"),
    HM10GF("6303755", "Тепло прямое", "hm10", "Теплотрасса 10"),
    HM10GB("6303754", "Тепло обратное", "hm10", "Теплотрасса 10"),

    PARP("6303770", "Давление", "par", "Пар"),
    PART("6303766", "Температура", "par", "Пар"),
    PARC("6303768", "Расход", "par", "Пар"),
    PARG("6303763", "Тепло", "par", "Пар"),

    GVSP("6303771", "Давление", "gvs", "ГВС"),
    GVST("6303767", "Температура", "gvs", "ГВС"),
    GVSC("6303769", "Расход", "gvs", "ГВС"),
    GVSG("6303764", "Тепло", "gvs", "ГВС"),

    SNPC("6303771", "Расход обессоленой воды", "sn", "Собственные нужды"),
    SNHVC("6303767", "Расход хол. воды из \"ГВК\"", "sn", "Собственные нужды"),
    SNAB("6303769", "Уровень воды в АБ", "sn", "Собственные нужды"),
    SNPARC("6303764", "Расход пара", "sn", "Собственные нужды");



    public final String id, name, code, hm;
    IDs(String id, String name, String code, String hm) {
        this.id = id;
        this.name = name;
        this.code = code;
        this.hm = hm;
    }

    public String getName() {
        return name;
    }
}