package ru.dgk.DataTECg.entity;

public enum IDs {

    HM1MAKEUP("6303789", "Подпитка", "hm1", "Теплотрасса 1,2"),
    HM1СF("6303717", "Расход прямой.", "hm1", "Теплотрасса 1,2"),
    HM1CB("6303716", "Расход обратный", "hm1", "Теплотрасса 1,2"),
    HM1PB("6303715", "Давление обратное", "hm1", "Теплотрасса 1,2"),
    HM1PF("6303714", "Давление прямое", "hm1", "Теплотрасса 1,2"),
    HM1TF("6303712", "Температура прямая", "hm1", "Теплотрасса 1,2"),
    HM1TB("6303711", "Температура обрат.", "hm1", "Теплотрасса 1,2"),
    HM1GF("6303710", "Тепло прямое", "hm1", "Теплотрасса 1,2"),
    HM1GB("6303709", "Тепло обратное", "hm1", "Теплотрасса 1,2"),

    HM3MAKEUP("6303809", "Подпитка", "hm3", "Теплотрасса 3"),
    HM3СF("6303726", "Расход прямой.", "hm3", "Теплотрасса 3"),
    HM3CB("6303725", "Расход обратный", "hm3", "Теплотрасса 3"),
    HM3PB("6303723", "Давление обратное", "hm3", "Теплотрасса 3"),
    HM3PF("6303760", "Давление прямое", "hm3", "Теплотрасса 3"),
    HM3TF("6303721", "Температура прямая", "hm3", "Теплотрасса 3"),
    HM3TB("6303720", "Температура обрат.", "hm3", "Теплотрасса 3"),
    HM3GF("6303719", "Тепло прямое", "hm3", "Теплотрасса 3"),
    HM3GB("6303718", "Тепло обратное", "hm3", "Теплотрасса 3"),

    HM7MAKEUP("6303810", "Подпитка", "hm7", "Теплотрасса 7"),
    HM7СF("6303735", "Расход прямой.", "hm7", "Теплотрасса 7"),
    HM7CB("6303734", "Расход обратный", "hm7", "Теплотрасса 7"),
    HM7PB("6303732", "Давление обратное", "hm7", "Теплотрасса 7"),
    HM7PF("6303733", "Давление прямое", "hm7", "Теплотрасса70"),
    HM7TF("6303730", "Температура прямая", "hm7", "Теплотрасса 7"),
    HM7TB("6303729", "Температура обрат.", "hm7", "Теплотрасса 7"),
    HM7GF("6303728", "Тепло прямое", "hm7", "Теплотрасса 7"),
    HM7GB("6303727", "Тепло обратное", "hm7", "Теплотрасса 7"),

    HM10MAKEUP("6303790", "Подпитка", "hm10", "Теплотрасса 10"),
    HM10СF("6303761", "Расход прямой.", "hm10", "Теплотрасса 10"),
    HM10CB("6303762", "Расход обратный", "hm10", "Теплотрасса 10"),
    HM10PB("6303759", "Давление обратное", "hm10", "Теплотрасса 10"),
    HM10PF("6303760", "Давление прямое", "hm10", "Теплотрасса 10"),
    HM10TF("6303757", "Температура прямая", "hm10", "Теплотрасса 10"),
    HM10TB("6303756", "Температура обрат.", "hm10", "Теплотрасса 10"),
    HM10GF("6303755", "Тепло прямое", "hm10", "Теплотрасса 10"),
    HM10GB("6303754", "Тепло обратное", "hm10", "Теплотрасса 10");

    public final String id, name, code, hm;
    IDs(String id, String name, String code, String hm) {
        this.id = id;
        this.name = name;
        this.code = code;
        this.hm = hm;
    }

    public String getName() {
        return name;
    }
}